HarryVienna/ESP32-Weather-Station-and-Air-Quality-Monitor/Sensor-LORA-BME280/sdkconfig.defaults
# Target chip
CONFIG_IDF_TARGET="esp32s3"

# No reboot after panic
CONFIG_ESP_SYSTEM_PANIC_PRINT_HALT=y

# 80 MHz is sufficient for I2C/SPI/ADC — saves ~40 mA vs 240 MHz during active phase
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_80=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ=80

# Flash size (detected 8 MB)
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="8mb"
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# ADC Calibration: ESP32-S3 uses curve fitting
CONFIG_ADC_CALI_CURVE_FITTING_ENABLE=y

# Skip firmware SHA256 validation on deep-sleep wake
CONFIG_BOOTLOADER_SKIP_VALIDATE_IN_DEEP_SLEEP=y
CONFIG_BOOTLOADER_SKIP_VALIDATE_ON_POWER_ON=y
CONFIG_BOOTLOADER_SKIP_VALIDATE_ALWAYS=y

CONFIG_BOOTLOADER_LOG_LEVEL_NONE=y
CONFIG_BOOTLOADER_LOG_LEVEL=0
#CONFIG_BOOT_ROM_LOG_ALWAYS_OFF=y

CONFIG_ESP_PHY_CALIBRATION_AND_DATA_STORAGE=y
CONFIG_ESP_PHY_CALIBRATION_MODE=1

#CONFIG_FREERTOS_UNICORE=y
#CONFIG_FREERTOS_HZ=1000

CONFIG_LOG_DEFAULT_LEVEL_NONE=y
CONFIG_BOOTLOADER_LOG_LEVEL_NONE=y
